app/helpers/application_helper.rb

  def restaurant_owner?(restaurant)
    return false unless restaurant.user.present?
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1