app/views/restaurants/_menu_item_public_card.html.erb

  <!-- Compliance Badges -->
  <% if defined?(@restaurant) && @restaurant.regions.active.any? %>
---
SELECT 1 AS one FROM "regions" INNER JOIN "restaurant_regions" ON "regions"."id" = "restaurant_regions"."region_id" WHERE "restaurant_regions"."restaurant_id" = 7 AND "regions"."active" = TRUE LIMIT 1

  <!-- ML Prediction Badge -->
  <% if defined?(@restaurant) && @restaurant.menu_predictions.any? %>
---
SELECT 1 AS one FROM "menu_predictions" WHERE "menu_predictions"."restaurant_id" = 7 LIMIT 1

  <!-- Promotion Badge -->
  <% active_promotion = @active_promotions&.find { |p| p.applies_to_item?(menu_item) } || menu_item.promotions.active.current.first %>
---
SELECT "promotions".* FROM "promotions" INNER JOIN "menu_item_promotions" ON "promotions"."id" = "menu_item_promotions"."promotion_id" WHERE "menu_item_promotions"."menu_item_id" = 18 AND "promotions"."active" = TRUE AND (start_date <= '2025-11-22 22:13:15.715039' AND end_date >= '2025-11-22 22:13:15.715089') ORDER BY "promotions"."id" ASC LIMIT 1

        display_price = price_variant&.price || menu_item.price
        active_promotion = @active_promotions&.find { |p| p.applies_to_item?(menu_item) } || menu_item.promotions.active.current.first
---
SELECT "promotions".* FROM "promotions" INNER JOIN "menu_item_promotions" ON "promotions"."id" = "menu_item_promotions"."promotion_id" WHERE "menu_item_promotions"."menu_item_id" = 18 AND "promotions"."active" = TRUE AND (start_date <= '2025-11-22 22:17:34.064012' AND end_date >= '2025-11-22 22:17:34.064056') ORDER BY "promotions"."id" ASC LIMIT 1