app/views/restaurants/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
            </h1>
            <% if @restaurant.user.present? %>

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7
SELECT 1 AS one FROM "menu_items" WHERE "menu_items"."restaurant_id" = 5 LIMIT 1
---
            </div>
            <% if @restaurant.menu_items.any? %>

SELECT COUNT(*) FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7
---
                </svg>
                <span><%= pluralize(@restaurant.menu_items.count, 'menu item') %></span>

SELECT 1 AS one FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7 LIMIT 1
SELECT COUNT(*) FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7
---
              <h2 class="text-2xl font-bold text-gray-900">Menu</h2>
              <% if @restaurant.menu_items.any? %>
                <p class="text-gray-600 text-sm mt-1"><%= pluralize(@restaurant.menu_items.count, 'item') %> available</p>

SELECT 1 AS one FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7 LIMIT 1
SELECT COUNT(*) FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7
---
          <% end %>
          <% if @restaurant.menu_items.any? %>
            <span class="bg-indigo-100 text-indigo-700 text-sm font-semibold px-3 py-1 rounded-full">
              <%= @restaurant.menu_items.count %>

SELECT 1 AS one FROM "dietary_feedbacks" WHERE "dietary_feedbacks"."restaurant_id" = 7 AND "dietary_feedbacks"."resolved" = FALSE LIMIT 1
---
                <span>Dietary Feedback</span>
                <% if @restaurant.dietary_feedbacks.unresolved.any? %>

SELECT 1 AS one FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7 LIMIT 1
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7
---
        <div class="p-8">
          <% if @restaurant.menu_items.any? %>
            <div class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-6">
              <% @restaurant.menu_items.each do |item| %>

SELECT COUNT(*) FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7
---
                <h2 class="text-2xl font-bold text-gray-900">Menu</h2>
                <% if @restaurant.menu_items.any? %>
                  <p class="text-gray-600 text-sm mt-1"><%= pluralize(@restaurant.menu_items.count, 'item') %> available</p>

SELECT COUNT(*) FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7
---
          <% end %>
          <% if @restaurant.menu_items.any? %>
            <span class="bg-indigo-100 text-indigo-700 text-sm font-semibold px-3 py-1 rounded-full">
              <%= @restaurant.menu_items.count %>

SELECT 1 AS one FROM "dietary_feedbacks" WHERE "dietary_feedbacks"."restaurant_id" = 7 AND "dietary_feedbacks"."resolved" = FALSE LIMIT 1
---
                <span>Dietary Feedback</span>
                <% if @restaurant.dietary_feedbacks.unresolved.any? %>

SELECT COUNT(*) FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7
---
              <span class="text-gray-600">Menu Items</span>
              <span class="text-2xl font-bold text-indigo-600"><%= @restaurant.menu_items.count %></span>

SELECT COUNT(*) FROM "qr_codes" WHERE "qr_codes"."restaurant_id" = 7
---
              <span class="text-gray-600">QR Codes</span>
              <span class="text-2xl font-bold text-indigo-600"><%= @restaurant.qr_codes.count %></span>