app/views/discoveries/index.html.erb

            <p class="text-gray-600">
              <%= pluralize(@restaurants.count, 'restaurant') %> found
---
SELECT COUNT(*) FROM "restaurants"

                    <span class="text-gray-600">
                      <%= pluralize(restaurant.menu_items.count, 'menu item') %>
                    </span>
                    <% if restaurant.menu_items.any? %>
                      <%
                        dietary_tags = restaurant.menu_items.pluck(:dietary_tags)
                                                   .map { |tags| tags.is_a?(String) ? (JSON.parse(tags) rescue []) : (tags || []) }
                                                   .flatten
                                                   .compact
                                                   .uniq
---
SELECT COUNT(*) FROM "menu_items" WHERE "menu_items"."restaurant_id" = 1
SELECT 1 AS one FROM "menu_items" WHERE "menu_items"."restaurant_id" = 1 LIMIT 1
SELECT "menu_items"."dietary_tags" FROM "menu_items" WHERE "menu_items"."restaurant_id" = 7