app/controllers/dietary_feedbacks_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = 7 LIMIT 1
---
  def set_restaurant
    @restaurant = Restaurant.find(params[:restaurant_id])