app/controllers/discoveries_controller.rb

  def index
    @query = params[:query]&.strip
    @cuisine = params[:cuisine]&.strip
    @dietary_option = params[:dietary_option]&.strip

    @restaurants = Restaurant.all

    # Apply search filters
    @restaurants = @restaurants.by_name(@query) if @query.present?
    @restaurants = @restaurants.by_cuisine(@cuisine) if @cuisine.present?
    @restaurants = @restaurants.with_dietary_option(@dietary_option) if @dietary_option.present?

    # Order by name
    @restaurants = @restaurants.order(:name)

    # Get unique cuisines for filter dropdown
    @cuisines = Restaurant.where.not(cuisine: [nil, '']).distinct.pluck(:cuisine).compact.sort

    # Get unique dietary options from menu items
    @dietary_options = MenuItem.where.not(dietary_tags: [nil, ''])
                                .pluck(:dietary_tags)
                                .map do |tags|
---
SELECT "restaurants".* FROM "restaurants" ORDER BY "restaurants"."name" ASC
SELECT 1 AS one FROM "restaurants" LIMIT 1
SELECT DISTINCT "restaurants"."cuisine" FROM "restaurants" WHERE NOT (("restaurants"."cuisine" = '' OR "restaurants"."cuisine" IS NULL))
SELECT "menu_items"."dietary_tags" FROM "menu_items" WHERE NOT (("menu_items"."dietary_tags" = '""' OR "menu_items"."dietary_tags" IS NULL))