app/controllers/restaurants_controller.rb

  def menu
    # Get selected location from params, session, or GPS
    @selected_location = nil

    # Priority: 1. URL param, 2. Session, 3. GPS detection
    if params[:location_id].present?
      @selected_location = @restaurant.locations.active.find_by(id: params[:location_id])
      session[:selected_location_id] = @selected_location&.id
    elsif session[:selected_location_id].present?
      @selected_location = @restaurant.locations.active.find_by(id: session[:selected_location_id])
    elsif params[:latitude].present? && params[:longitude].present?
      # GPS coordinates provided
      latitude = params[:latitude].to_f
      longitude = params[:longitude].to_f
      @selected_location = find_nearest_location(@restaurant, latitude, longitude, max_distance_km: 50)
      session[:selected_location_id] = @selected_location&.id if @selected_location
    end

    # Get location-specific menu items
    if @selected_location.present?
---
SELECT 1 AS one FROM "locations" WHERE "locations"."restaurant_id" = 1 AND "locations"."active" = TRUE LIMIT 1

    @active_promotions = []
    if @restaurant.respond_to?(:promotions)
      begin
        @active_promotions = @restaurant.promotions.active.current.order(start_date: :desc) rescue []
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."restaurant_id" = 7 AND "promotions"."active" = TRUE AND (start_date <= '2025-11-22 22:13:15.458395' AND end_date >= '2025-11-22 22:13:15.458471') ORDER BY "promotions"."start_date" DESC

    # Track QR scan (if qr_scans association exists)
    if @restaurant.respond_to?(:qr_scans)
      begin
        @restaurant.qr_scans.create!(
          scanned_at: Time.current,
          ip_address: request.remote_ip,
          user_agent: request.user_agent
        )
---
INSERT INTO "qr_scans" ("restaurant_id", "scanned_at", "ip_address", "user_agent", "created_at", "updated_at") VALUES (2, '2025-11-21 08:08:14.766480', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36 Edg/142.0.0.0', '2025-11-21 08:08:14.770132', '2025-11-21 08:08:14.770132') RETURNING "id"

      begin
        active_tests = @restaurant.split_tests.active.includes(:split_test_variants, :menu_item)
        active_tests.each do |test|
          if test.menu_item.present?
---
SELECT 1 AS one FROM "menu_items" WHERE "menu_items"."restaurant_id" = 1 LIMIT 1

  def create
    @restaurant = Restaurant.new(restaurant_params)

    # Assign user if authentication is available
    if respond_to?(:user_signed_in?) && user_signed_in? && respond_to?(:current_user)
      @restaurant.user = current_user
    end

    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "description", "address", "created_at", "updated_at", "phone_number", "user_id") VALUES ('test Resturant', 'testing baby', 'resturant hood', '2025-11-20 03:43:50.125203', '2025-11-20 03:43:50.125203', '8877', NULL) RETURNING "id"