app/models/menu_item_analytics.rb

  def self.track_order(menu_item, revenue: nil, request: nil)
    today = Date.current
    analytics = find_or_initialize_by(menu_item: menu_item, date: today, restaurant: menu_item.restaurant)
    analytics.orders = (analytics.orders || 0) + 1
---
SELECT "menu_item_analytics".* FROM "menu_item_analytics" WHERE "menu_item_analytics"."menu_item_id" = 18 AND "menu_item_analytics"."date" = '2025-11-22' AND "menu_item_analytics"."restaurant_id" = 7 LIMIT 1