app/models/rating.rb

SELECT COUNT(*) FROM "ratings" WHERE "ratings"."menu_item_id" = 18
---
  def self.rating_count_for(menu_item)
    where(menu_item: menu_item).count