app/models/restaurant.rb

  def has_branding?
    branding.present? && branding.has_custom_branding?
---
SELECT "brandings".* FROM "brandings" WHERE "brandings"."restaurant_id" = 1 LIMIT 1